Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ТекстыАвтоматическихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ТекстыАвтоматическихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_ТипыТекстовСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ЯзыкиЧатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/CommonModules/iga_ШаблоныСообщений/Ext/Module.bsl
Функция ПолучитьТекстСообщения(Тип, Язык = 0) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ТекстыАвтоматическихСообщений.Тип КАК Тип,
	               |	iga_ТекстыАвтоматическихСообщений.Текст КАК Текст
	               |ИЗ
	               |	РегистрСведений.iga_ТекстыАвтоматическихСообщений КАК iga_ТекстыАвтоматическихСообщений
	               |ГДЕ
	               |	iga_ТекстыАвтоматическихСообщений.Тип = &Тип
	               |	И (iga_ТекстыАвтоматическихСообщений.Язык.Код = &Код
	               |			ИЛИ iga_ТекстыАвтоматическихСообщений.Язык = &Код)";
	Запрос.УстановитьПараметр("Тип", Тип);
	Запрос.УстановитьПараметр("Код", Язык);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Текст;
	Иначе
		
		ИндексПеречисления = Перечисления.iga_ТипыТекстовСообщений.Индекс(Тип);
		
		ТекстПоУмолчанию = Перечисления.iga_ТипыТекстовСообщений.ТекстПоУмолчанию(Тип);
		
		Возврат ТекстПоУмолчанию;
	КонецЕсли;
	
КонецФункции                          

Функция ПолучитьСтрокуСсылки(Идентификатор)
	
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	// Ищем фрагмент Ref="ИмяБазы"
	НачалоИмени = Найти(СтрокаСоединения, "Ref=""") + 5;
	КонецИмени = Найти(Сред(СтрокаСоединения, НачалоИмени), """");
	ИмяБазы = Сред(СтрокаСоединения, НачалоИмени, КонецИмени - 1);
	
	
	Ссылка = "https://1c.divera.kz/" + ИмяБазы + "/hs/int-services/med/image?id=" + Идентификатор;

	Возврат Ссылка;
	
КонецФункции
